In [2]:
import pandas as pd

In [3]:
data=[1,2,3,4]
df=pd.DataFrame(data)

In [4]:
df

   0
0  1
1  2
2  3
3  4

In [7]:
data=[['alex',10],['jhon',20],['dfgds',56],['ghdsgg',66]]

In [16]:
df=pd.DataFrame(data ,columns=['name','age'],dtype=float,index=['row1','row2','row3','row4'])

In [17]:
df

        name   age
row1    alex  10.0
row2    jhon  20.0
row3   dfgds  56.0
row4  ghdsgg  66.0

In [24]:
data1=[{11:'abc',22:'jdfhdj',66:'fdskjf'},{12:'pqr'},{13:'xyz'}]

In [25]:
df1=pd.DataFrame(data1)

In [26]:
df1

    11   12   13      22      66
0  abc  NaN  NaN  jdfhdj  fdskjf
1  NaN  pqr  NaN     NaN     NaN
2  NaN  NaN  xyz     NaN     NaN

In [43]:
d={'one':pd.Series([1,2,3,4],index=['a','b','c','d']),
    'two':pd.Series([5,6,7,8],index=['a','b','c','d']),
 }

In [44]:
d

{'one': a    1
 b    2
 c    3
 d    4
 dtype: int64, 'two': a    5
 b    6
 c    7
 d    8
 dtype: int64}

In [9]:
df2=pd.DataFrame(d)

NameError: name 'd' is not defined

In [46]:
df2

   one  two
a    1    5
b    2    6
c    3    7
d    4    8

# accessing the element

In [48]:
df2['one']

a    1
b    2
c    3
d    4
Name: one, dtype: int64

# adding new column
df2['three']=pd.Series([9,10,11,12],index=['a','b','c','d'])

In [52]:
df2

   one  two  three
a    1    5      9
b    2    6     10
c    3    7     11
d    4    8     12

In [54]:
df2['four']=pd.Series([55,66,77,33],index=['a','b','c','d'])

In [8]:
df2

NameError: name 'df2' is not defined

# rows selection
df2.loc['a']

In [58]:
df2.loc['c']

one       3
two       7
three    11
four     77
Name: c, dtype: int64

In [61]:
df2['one']

a    1
b    2
c    3
d    4
Name: one, dtype: int64

In [62]:
df2.iloc[0:3]

   one  two  three  four
a    1    5      9    55
b    2    6     10    66
c    3    7     11    77

In [65]:
df2[2:3]

   one  two  three  four
c    3    7     11    77

In [5]:
#adding a row
lst1=[22,33,44,55]
f1=pd.DataFrame(lst1)

In [6]:
f1

    0
0  22
1  33
2  44
3  55

In [11]:
lst1=[4,5,6,7]
lst2=[5,6,7,8]
lst3=[8,9,0,1]
f1=pd.DataFrame(list(zip(lst1,lst2,lst3)))

In [12]:
f1

   0  1  2
0  4  5  8
1  5  6  9
2  6  7  0
3  7  8  1

# dataframe using list inside dic
lst1=['abc','pqr','xyz']
lst2=['id1','id2','id3']
lst3=[54,78,90]

dic1={'name':lst1,'id':lst2,'marks':lst3}

df=pd.DataFrame(dic1)

In [14]:
df

  name   id  marks
0  abc  id1     54
1  pqr  id2     78
2  xyz  id3     90

In [19]:
dic={'name':'newname','id':'id4','marks':99}

In [20]:
dic

{'name': 'newname', 'id': 'id4', 'marks': 99}

In [26]:
df1=pd.DataFrame({"name":'ddffd',"id":'cjsd',"marks":88},index=[3])

In [27]:
df1

    name    id  marks
3  ddffd  cjsd     88

In [28]:
df.append(df1)

    name    id  marks
0    abc   id1     54
1    pqr   id2     78
2    xyz   id3     90
3  ddffd  cjsd     88